Шаблоны/361-Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:soc="http://socit.ru" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns="urn://x-artefacts-it-ru/dob/poltava/inquiry-smev/req-resp/1.1">
  <soap:Body wsu:Id="body">
    <soc:execute>
      <smev:Message>
        <smev:Sender>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Sender>
        <smev:Recipient>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Recipient>
        <smev:Service>
          <smev:Mnemonic>TestMnemonic</smev:Mnemonic>
          <smev:Version>1.00</smev:Version>
        </smev:Service>
        <smev:TypeCode>GSRV</smev:TypeCode>
        <smev:Status>REQUEST</smev:Status>
        <smev:Date>#DATE#</smev:Date>
        <smev:ExchangeType>2</smev:ExchangeType>
        <smev:TestMsg>Test</smev:TestMsg>
        <smev:OKTMO>#OKTMO#</smev:OKTMO>
      </smev:Message>
      <smev:MessageData>
        <smev:AppData>
          <RequestGuardianshipOrg>
            <LastName>#FAMIL#</LastName>
            <FirstName>#NAME#</FirstName>
            <SecondName>#OTCH#</SecondName>
            <SNILS>#SNILS#</SNILS>
            <DateBirth>#DROG#</DateBirth>
          </RequestGuardianshipOrg>
        </smev:AppData>
      </smev:MessageData>
    </soc:execute>
  </soap:Body>
</soap:Envelope>
